# day 23

In [2]:
import pandas as pd
import numpy as np

In [3]:
name = ["Kelly",np.nan,"Jon","Ken","Tim","Pel"]
grades = [30,40,30,67,np.nan,55]
age = [15,np.nan,18,17,np.nan,16]

In [4]:
df = pd.DataFrame({"Name": name, "Grades": grades, "Age": age })
df

    Name  Grades   Age
0  Kelly    30.0  15.0
1    NaN    40.0   NaN
2    Jon    30.0  18.0
3    Ken    67.0  17.0
4    Tim     NaN   NaN
5    Pel    55.0  16.0

In [5]:
df.isna().sum()

Name      1
Grades    1
Age       2
dtype: int64

In [6]:
from sklearn.impute import SimpleImputer

In [7]:
df2 = df.copy()

In [8]:
imputer_names = SimpleImputer( strategy="constant" , fill_value="Paul",)
imputer_grades = SimpleImputer(strategy="mean")
imputer_age = SimpleImputer(strategy = "median")

df2[["Name"]] = imputer_names.fit_transform(df2[["Name"]])
df2[["Grades"]] = imputer_grades.fit_transform(df2[["Grades"]])
df2[["Age"]]  = imputer_age.fit_transform(df2[["Age"]])

In [9]:
df2

    Name  Grades   Age
0  Kelly    30.0  15.0
1   Paul    40.0  16.5
2    Jon    30.0  18.0
3    Ken    67.0  17.0
4    Tim    44.4  16.5
5    Pel    55.0  16.0

In [10]:
df3 = df.copy()
df3

    Name  Grades   Age
0  Kelly    30.0  15.0
1    NaN    40.0   NaN
2    Jon    30.0  18.0
3    Ken    67.0  17.0
4    Tim     NaN   NaN
5    Pel    55.0  16.0

In [11]:
a = pd.DataFrame(df3.isna().sum(),columns=["tot"])
a

        tot
Name      1
Grades    1
Age       2

In [12]:
a["percentage"] = a["tot"]*100/df3["Age"].size

In [13]:
a

        tot  percentage
Name      1   16.666667
Grades    1   16.666667
Age       2   33.333333

In [77]:
df4 = df3.columns.where(a["percentage"]>30.0)
c = [x for x in df4 if x is not None]
c

['Age']

In [81]:
df5 = df3.drop(c , axis =1)
df5

    Name  Grades
0  Kelly    30.0
1    NaN    40.0
2    Jon    30.0
3    Ken    67.0
4    Tim     NaN
5    Pel    55.0

In [82]:
mis = df3.isnull().mean()

In [84]:
mis_dr = mis[mis>0.30]

In [85]:
mis_dr

Age    0.333333
dtype: float64

In [87]:
df3.drop(mis_dr.index, axis = 1)

    Name  Grades
0  Kelly    30.0
1    NaN    40.0
2    Jon    30.0
3    Ken    67.0
4    Tim     NaN
5    Pel    55.0

In [107]:
df5.duplicated("Name")

RangeIndex(start=0, stop=6, step=1)

In [145]:
c = df3.groupby("Name").agg({'Grades': ['mean','min','max']})
c

      Grades
        mean   min   max
Name
Jon     30.0  30.0  30.0
Kelly   30.0  30.0  30.0
Ken     67.0  67.0  67.0
Pel     55.0  55.0  55.0
Tim      NaN   NaN   NaN

In [143]:
k = pd.DataFrame(c)
k

       0                                              1
0    Jon        Name  Grades   Age
2  Jon    30.0  18.0
1  Kelly      Name  Grades   Age
0  Kelly    30.0  15.0
2    Ken        Name  Grades   Age
3  Ken    67.0  17.0
3    Pel        Name  Grades   Age
5  Pel    55.0  16.0
4    Tim          Name  Grades  Age
4  Tim     NaN  NaN

In [135]:
k.agg("Name")

AttributeError: 'Name' is not a valid function for 'DataFrame' object